#include <stdio.h>
#include<locale.h>
#include <stdlib.h>
#include<iostream>
using namespace std;
/*******************************************************/
/*           Лабораторная  работа #1                   */
/*          Типы данных и ввод-вывод                   */
/*        Пример выполнения. Вариант #19.              */

int main(void) {
	setlocale(LC_ALL, "Rus");//локализация,чтобы использовать русский
	//создаем переменные для ввода данных 
	char material1[9], material2[9], material3[9];//выдиления места памяти для строк 
	char type1, type2, type3;//создаем типы
	char wet1[6], wet2[6], wet3[6];//создаем переменные для влажности
	float Coeff1, Coeff2, Coeff3;//создаем переменные для Коэффициентов
	/* Введение фактических данных*/
	//cin - ввод данных
	
	printf("1. Введите:  вещество, Тип, Влажность(%), Коэффициент >");
	cin >> material1;
	cin >> type1;
	cin >> wet1;
	cin >> Coeff1;

	printf("2. Введите:  вещество, Тип, Влажность(%), Коэффициент >");
	cin >> material2;
	cin >> type2;
	cin >> wet2;
	cin >> Coeff2;

	printf("3. Введите:  вещество, Тип, Влажность(%), Коэффициент >");
	cin >> material3;
	cin >> type3;
	cin >> wet3;
	cin >> Coeff3;
	//вывод таблицы в конце выполнения программы
	printf("-----------------------------------------------\n");
	printf("|Коэффициенты теплопроводимости материаллов\n");
	printf("|---------------------------------------------|\n");
	printf("| вещество | Тип | Влажность(%) | Коэффициент  |\n");
	printf("|----------|-----|-------------|--------------|\n");
	/* вывод строк фактических данных */
	printf("| %8s |  %c  |    %5s    |   %-5.1f      |\n", material1, type1, wet1, Coeff1);
	printf("| %8s |  %c  |    %5s    |   %-5.1f      |\n", material2, type2, wet2, Coeff2);
	printf("| %8s |  %c  |    %5s    |   %-5.1f      |\n", material3, type3, wet3, Coeff3);
	/* вывод примечаний */
	printf("|---------------------------------------------|\n");
	printf("| Примечание: М - металлы, Т - термоизо-      |\n");
	printf("| ляционные  материалы, Д - другие материалы: |\n");
	printf("-----------------------------------------------\n");
	return 0;
}